app/views/home/_admin_home.html.erb

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 4]]
---
		<tr>
			<td><%=	Event.find(registration.event_id).title %></td>