app/controllers/events_controller.rb

  def index

    @events = Event.all
---
SELECT "events".* FROM "events" WHERE (start_date >= '2012-10-14')

  def show

    # Store the current event in a session variable for registration purposes.
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @event = Event.new(params[:event])

    authorize! :create, @event

    # Sets hidden fields when user creates an event.
    # Creator of the event is set to the current user, and the event is set to active.
    @event.user_id = current_user.id
    @event.active = true

    if @event.save
---
INSERT INTO "events" ("active", "capacity", "created_at", "description", "end_date", "end_time", "event_type", "location", "registration", "start_date", "start_time", "title", "trainer_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def register

    @registration = Registration.new

    @registration.event_id = session[:event_id]
    @registration.user_id = session[:user_id]

    if @registration.save
      redirect_to Event.find(session[:event_id]), :notice => "You have successfully registered for this event."
---
INSERT INTO "registrations" ("created_at", "event_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 15 Oct 2012 00:44:57 UTC +00:00], ["event_id", 4], ["updated_at", Mon, 15 Oct 2012 00:44:57 UTC +00:00], ["user_id", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 5]]

  def unregister

    @registration = Registration.find(params[:registration_id])

    if @registration.destroy
      redirect_to Event.find(session[:event_id]), :notice => "You have unregistered for this event."
---
SELECT "registrations".* FROM "registrations" WHERE "registrations"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "registrations" WHERE "registrations"."id" = ?  [["id", 5]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 6]]

  def update
    @event = Event.find(params[:id])
    if @event.update_attributes(params[:event])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "events" SET "title" = 'Spring', "updated_at" = '2013-02-25 05:35:03.514493' WHERE "events"."id" = 1