app/controllers/foods_controller.rb

  def show
    @food = Food.find(params[:id])
    session[:food_id] = @food.id
    @favorite = FavoriteFood.where(:user_id => current_user.id, :food_id => @food.id).first
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "favorite_foods".* FROM "favorite_foods" WHERE "favorite_foods"."user_id" IS NULL AND "favorite_foods"."food_id" = 1 LIMIT 1
SELECT "user_foods".* FROM "user_foods" WHERE "user_foods"."user_id" IS NULL AND "user_foods"."food_id" = 1 LIMIT 1

  def create
    @food = Food.new(params[:food])
    if @food.save
---
INSERT INTO "foods" ("calories", "cost", "created_at", "description", "food_type", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def add_favorite
    @ff = FavoriteFood.new
    @ff.food_id = params[:food_id]
    @ff.user_id = session[:user_id]

    if @ff.save
---
INSERT INTO "favorite_foods" ("created_at", "food_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 15 Oct 2012 03:26:32 UTC +00:00], ["food_id", nil], ["updated_at", Mon, 15 Oct 2012 03:26:32 UTC +00:00], ["user_id", 1]]

  def remove_favorite
    @favorite = FavoriteFood.find(params[:favorite_id])

    if @favorite.destroy
---
SELECT "favorite_foods".* FROM "favorite_foods" WHERE "favorite_foods"."id" = ? LIMIT 1  [["id", "6"]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "favorite_foods" WHERE "favorite_foods"."id" = ?  [["id", 6]]

  def mark_as_eaten
    @ef = UserFood.new
    @ef.food_id = params[:food_id]
    @ef.user_id = session[:user_id]

    if @ef.save
---
INSERT INTO "user_foods" ("created_at", "date", "food_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 15 Oct 2012 04:48:58 UTC +00:00], ["date", nil], ["food_id", nil], ["updated_at", Mon, 15 Oct 2012 04:48:58 UTC +00:00], ["user_id", 1]]

  def unmark_as_eaten

    puts params[:ef_id]

    @ef = UserFood.find(params[:ef_id])


    if @ef.destroy
---
SELECT "user_foods".* FROM "user_foods" WHERE "user_foods"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "user_foods" WHERE "user_foods"."id" = ?  [["id", 2]]