app/controllers/home_controller.rb

SELECT "registrations".* FROM "registrations" WHERE "registrations"."user_id" = 1
SELECT "user_foods".* FROM "user_foods" WHERE "user_foods"."user_id" = 1
SELECT "favorite_foods".* FROM "favorite_foods" WHERE "favorite_foods"."user_id" = 1
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 4]]
---
  def index
  	if !current_user.nil?
  		@registrations = Registration.where(:user_id => current_user.id)
  		@foods = UserFood.where(:user_id => current_user.id)
  		@favorites = FavoriteFood.where(:user_id => current_user.id)
  		@classes = Registration.where(:user_id => current_user.id)
  		@classes.reject!{ |c| Event.find(c.event_id).event_type != 2 }