app/controllers/users_controller.rb

INSERT INTO "users" ("access_level", "active", "created_at", "date_of_birth", "email", "first_name", "height", "last_name", "password_hash", "password_salt", "updated_at", "username", "weight") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    if @user.save